lilihang123/AB162XM_project/modules/hal/nxp/mcux/mcux-sdk/devices/MKE18F16/mcuxpresso/startup_mke18f16.c
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM4
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    DebugMon_Handler,                  // Debug monitor handler
    0,                                 // Reserved
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler

    // Chip Level - MKE18F16
    DMA0_IRQHandler,                      // 16 : DMA channel 0 transfer complete
    DMA1_IRQHandler,                      // 17 : DMA channel 1 transfer complete
    DMA2_IRQHandler,                      // 18 : DMA channel 2 transfer complete
    DMA3_IRQHandler,                      // 19 : DMA channel 3 transfer complete
    DMA4_IRQHandler,                      // 20 : DMA channel 4 transfer complete
    DMA5_IRQHandler,                      // 21 : DMA channel 5 transfer complete
    DMA6_IRQHandler,                      // 22 : DMA channel 6 transfer complete
    DMA7_IRQHandler,                      // 23 : DMA channel 7 transfer complete
    DMA8_IRQHandler,                      // 24 : DMA channel 8 transfer complete
    DMA9_IRQHandler,                      // 25 : DMA channel 9 transfer complete
    DMA10_IRQHandler,                     // 26 : DMA channel 10 transfer complete
    DMA11_IRQHandler,                     // 27 : DMA channel 11 transfer complete
    DMA12_IRQHandler,                     // 28 : DMA channel 12 transfer complete
    DMA13_IRQHandler,                     // 29 : DMA channel 13 transfer complete
    DMA14_IRQHandler,                     // 30 : DMA channel 14 transfer complete
    DMA15_IRQHandler,                     // 31 : DMA channel 15 transfer complete
    DMA_Error_IRQHandler,                 // 32 : DMA error interrupt channels 0-15
    MCM_IRQHandler,                       // 33 : FPU sources
    FTFE_IRQHandler,                      // 34 : FTFE command complete
    Read_Collision_IRQHandler,            // 35 : FTFE read collision
    LVD_LVW_IRQHandler,                   // 36 : PMC controller low-voltage detect, low-voltage warning
    Doublebit_Fault_IRQHandler,           // 37 : FTFE double bit fault detect
    WDOG_EWM_IRQHandler,                  // 38 : Single interrupt vector for WDOG and EWM
    Reserved39_IRQHandler,                // 39 : Reserved interrupt
    LPI2C0_IRQHandler,                    // 40 : Inter-integrated circuit 0 interrupt
    LPI2C1_IRQHandler,                    // 41 : Inter-integrated circuit 1 interrupt
    LPSPI0_IRQHandler,                    // 42 : Serial peripheral Interface 0 interrupt
    LPSPI1_IRQHandler,                    // 43 : Serial peripheral Interface 1 interrupt
    Reserved44_IRQHandler,                // 44 : Reserved interrupt
    PWT_IRQHandler,                       // 45 : PWT interrupt
    Reserved46_IRQHandler,                // 46 : Reserved interrupt
    LPUART0_TX_IRQHandler,                // 47 : LPUART0 transmit interrupt
    LPUART0_RX_IRQHandler,                // 48 : LPUART0 receive interrupt
    LPUART1_TX_IRQHandler,                // 49 : LPUART1 transmit interrupt
    LPUART1_RX_IRQHandler,                // 50 : LPUART1 receive interrupt
    LPUART2_TX_IRQHandler,                // 51 : LPUART2 transmit interrupt
    LPUART2_RX_IRQHandler,                // 52 : LPUART2 receive interrupt
    Reserved53_IRQHandler,                // 53 : Reserved interrupt
    Reserved54_IRQHandler,                // 54 : Reserved interrupt
    ADC0_IRQHandler,                      // 55 : ADC conversion complete interrupt
    CMP0_IRQHandler,                      // 56 : CMP0 interrupt
    CMP1_IRQHandler,                      // 57 : CMP1 interrupt
    FTM0_IRQHandler,                      // 58 : FTM0 single interrupt vector for all sources
    FTM1_IRQHandler,                      // 59 : FTM1 single interrupt vector for all sources
    FTM2_IRQHandler,                      // 60 : FTM2 single interrupt vector for all sources
    Reserved61_IRQHandler,                // 61 : Reserved interrupt
    RTC_IRQHandler,                       // 62 : RTC alarm interrupt
    RTC_Seconds_IRQHandler,               // 63 : RTC seconds interrupt
    LPIT0_Ch0_IRQHandler,                 // 64 : LPIT channel 0 overflow interrupt
    LPIT0_Ch1_IRQHandler,                 // 65 : LPIT channel 1 overflow interrupt
    LPIT0_Ch2_IRQHandler,                 // 66 : LPIT channel 2 overflow interrupt
    LPIT0_Ch3_IRQHandler,                 // 67 : LPIT channel 3 overflow interrupt
    PDB0_IRQHandler,                      // 68 : Programmable delay block 0 interrupt
    Reserved69_IRQHandler,                // 69 : Reserved interrupt
    Reserved70_IRQHandler,                // 70 : Reserved interrupt
    Reserved71_IRQHandler,                // 71 : Reserved interrupt
    DAC0_IRQHandler,                      // 72 : Digital-to-analog converter 0 interrupt
    SCG_RCM_IRQHandler,                   // 73 : SCG_RCM interrupt
    LPTMR0_IRQHandler,                    // 74 : Single interrupt vector for  Low Power Timer 0 interrupt
    PORTA_IRQHandler,                     // 75 : Port A pin detect interrupt
    PORTB_IRQHandler,                     // 76 : Port B pin detect interrupt
    PORTC_IRQHandler,                     // 77 : Port C pin detect interrupt
    PORTD_IRQHandler,                     // 78 : Port D pin detect interrupt
    PORTE_IRQHandler,                     // 79 : Port E pin detect interrupt
    SWI_IRQHandler,                       // 80 : Software interrupt
    Reserved81_IRQHandler,                // 81 : Reserved interrupt
    Reserved82_IRQHandler,                // 82 : Reserved interrupt
    Reserved83_IRQHandler,                // 83 : Reserved interrupt
    PDB1_IRQHandler,                      // 84 : Programmable delay block 1 interrupt
    FLEXIO_IRQHandler,                    // 85 : FLEXIO interrupt
    CMP2_IRQHandler,                      // 86 : CMP2 interrupt
    FTM3_IRQHandler,                      // 87 : FlexTimer module 3 fault, overflow and channels interrupt
    Reserved88_IRQHandler,                // 88 : Reserved interrupt
    ADC1_IRQHandler,                      // 89 : ADC conversion complete interrupt
    ADC2_IRQHandler,                      // 90 : ADC conversion complete interrupt
    Reserved91_IRQHandler,                // 91 : Reserved interrupt
    Reserved92_IRQHandler,                // 92 : Reserved interrupt
    PDB2_IRQHandler,                      // 93 : Programmable delay block 2 interrupt
    CAN0_ORed_IRQHandler,                 // 94 : can
    CAN0_Error_IRQHandler,                // 95 : can
    CAN0_Wake_Up_IRQHandler,              // 96 : can
    CAN0_ORed_Message_buffer_IRQHandler,  // 97 : can
    Reserved98_IRQHandler,                // 98 : Reserved interrupt
    Reserved99_IRQHandler,                // 99 : Reserved interrupt
    Reserved100_IRQHandler,               // 100: Reserved interrupt
    CAN1_ORed_IRQHandler,                 // 101: can
    CAN1_Error_IRQHandler,                // 102: can
    CAN1_Wake_Up_IRQHandler,              // 103: can
    CAN1_ORed_Message_buffer_IRQHandler,  // 104: can


}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {

    // Disable interrupts
    __asm volatile ("cpsid i");


#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#else
    // Disable Watchdog
    // Write watchdog update key to unlock
    *((volatile unsigned int *)0x40052004) = 0xD928C520;
    // Set timeout value
    *((volatile unsigned int *)0x40052008) = 0xFFFF;
    // Now disable watchdog via control register
    volatile unsigned int *WDOG_CS = (unsigned int *) 0x40052000;
    *WDOG_CS = (*WDOG_CS & ~(1 << 7)) | (1 << 5);
#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

